<?php

/**
 * SmartPHP framework
 *
 * @name SmartPHP framework
 * @package SmartPHP
 * @author 费尔 <admin@smartphp.cn>
 * @version 1.0 Beta
 * @link http://www.smartphp.cn
 * @copyright smartphp.cn
 * @license <a href="http://www.smartphp.cn">smartphp</a>
 */

namespace Library;

/**
 * 验证类
 */
class Verify {

    public $config = [
        'codeset' => '012356789', // 验证码字符集合
        'expire' => 1800, // 验证码过期时间（s）
        'fontsize' => 25, // 验证码字体大小(px)
        'usecurve' => true, // 是否画混淆曲线
        'usenoise' => true, // 是否添加杂点
        'imageh' => 0, // 验证码图片高度
        'imagew' => 0, // 验证码图片宽度
        'length' => 6, // 验证码位数
        'fontttf' => '', // 验证码字体，不设置随机获取
        'bg' => [243, 251, 254], // 背景颜色
        'reset' => true, // 验证成功后是否重置,
        'usecn' => false, // 使用中文验证码 
        'cnset' => ['米德尔斯堡', '共产党宣言', '资产负债表', '非手术治疗', '民事诉讼法', '中国少年报', '劳动生产率', '中关村在线', '系统分析员', '泰坦尼克号', '劳动密集型', '后现代主义', '文化大革命', '石原慎太郎', '不正当竞争', '新疆维吾尔', '三九健康网', '村民委员会', '市场占有率', '土地使用权', '邓小平理论', '劳动力资源', '非理性主义', '国际金融报', '计算机病毒', '电视连续剧', '行政管理学', '精神分裂症', '非智力因素', '诺曼底登陆', '剩余劳动力', '新文化运动', '企业管理者', '法国大革命', '国际互联网', '国际电影节', '华尔街日报', '证券交易所', '维特根斯坦', '特洛伊木马', '唯物辩证法', '无政府主义', '新民主主义', '一言以蔽之', '刑事诉讼法', '行政诉讼法', '社会民主党', '马克思主义', '毛泽东思想', '南京大屠杀', '投资银行业', '政策性银行', '为人民服务', '自由职业者', '新闻发布会', '三叉神经痛', '人口老龄化', '网络管理员', '经济一体化', '政治经济学', '自然保护区', '更上一层楼', '社会保险费', '新产品开发', '所有者权益', '人民检察院', '内塔尼亚胡', '电子计算机', '企业所得税', '射雕英雄传', '经营管理者', '凯恩斯主义', '节目主持人', '大百科全书', '可持续发展', '武装直升机', '企业经营者', '犯罪嫌疑人', '古典经济学', '毕达哥拉斯', '可再生资源', '工商管理学', '中国人民银', '最惠国待遇', '产品质量法', '桑普多利亚', '生命伦理学', '小资产阶级', '房地产市场', '通货膨胀率', '德雷克斯勒', '媒体播放器', '社会主义者', '创造性思维', '宏观经济学', '华西都市报', '可行性研究', '防患于未然', '六一儿童节', '电视电话会', '劳动力市场', '消费者权益', '记者招待会', '关贸总协定', '人力资源部', '民族主义者', '规范性文件', '微型计算机', '库兹涅佐娃', '高级工程师', '市场经济体', '计算机网络', '装饰装修工', '科学技术部', '地方性法规', '居民委员会', '国家公务员', '劳动价值论', '亚里士多德', '调制解调器', '主观能动性', '法定代表人', '资产负债率', '高等教育学', '社会契约论', '人民陪审员', '邓小平文选', '法西斯主义', '个人所得税', '分子生物学', '发展中国家', '股份合作制', '时尚耀中国', '新娘和爸爸', '雷锋的故事', '北风那个吹', '追风筝的人', '不能没有她', '十二之天贰', '少年方世玉', '异界圣骑士', '湄洲岛奇缘', '麦霸英雄汇', '二十四城记', '一千滴眼泪', '小沈阳之夜', '因为我很笨', '短暂的生命', '爱就宅一起', '我叫小沈阳', '星光魔范生', '爱情的牙齿', '丑女大翻身', '飞屋环游记', '金融超限战', '狙击电话亭', '赖布衣传奇', '米奇妙妙屋', '母亲是条河', '燃情狙击手', '生死新纪元', '什锦八宝饭', '水银蒸发令', '太阳神诅咒', '梅泽由香里', '圣机师物语', '雷系魔法师', '饭岛友友子', '失踪的托蒂', '再续意难忘', '金牌魔术团', '又见白娘子', '宝莲灯前传', '我是谁的谁', '敲敲爱上你', '乞丐变王子', '薛丁山传奇', '天启四骑士', '小猪大行动', '我的好兄弟', '情乱夜中环', '熊猫回家路', '军事观察室', '燃烧的生命', '黄昏英雄传', '灿烂的遗产', '宫坂绘美里', '愚人的国度', '亲爱的敌人', '越跳越美丽', '游侠红牡丹', '向国旗敬礼', '柏拉图之恋', '成龙历险记', '圣灵降临节', '挺进莫斯科', '爱转了一圈', '贝卢斯科尼', '恐怖的爸妈', '魔女十八号', '福气又安康', '政坛秘闻录', '防务新观察', '微笑在我心', '威尼斯之女', '新奇迹世界', '油灯猫鼠图', '摸空姐指南', '一锁五十年', '中华小岳云', '逃离克隆岛', '家有外星人', '答应不爱你', '灰色的彩虹', '麦兜响当当', '机器人劫难', '牵住我的手', '开心学国学', '我要闪闪唱', '原来我不帅', '仁寺洞丑闻', '就想爱着你', '武契切维奇', '王贵与安娜', '大鹏嘚吧嘚', '我爱河东狮', '九转金身决', '公共情妇门', '如果可以爱', '命运的春天', '粉红系男孩', '爱不会绝迹', '太阳的女人', '南华梦飞翔', '嫁个好人家', '爱的华尔兹', '多余的流星', '亚洲第一爆', '我要的飞翔', '太空飞行棋', '伊辛巴耶娃', '古墓夺宝记', '天使的距离', '闯关东中篇', '北平战与和', '猜猜我是谁', '老大的幸福', '死亡计算器', '鸠山由纪夫', '迟来的坦白', '爱你千万次', '亲爱的别哭', '大嘴巴嘟嘟', '扶桑花女孩', '刀剑英雄二', '小牛向前冲', '只要爱上你', '敌特在行动', '婚礼策划者', '田中美绘子', '白色帆布鞋', '超自然活动', '女人的村庄', '三十风雨路', '蓝鳍金枪鱼', '小强爬行记', '比表面积仪', '打个大西瓜', '顶楼的大象', '猫愿三角恋', '秋冷了月光', '好想告诉你', '呼叫大明星', '下一站幸福', '春桃的战争', '天使的诱惑', '糖葫芦西施', '数字图书馆', '阿纳斯塔塞', '九死还魂草', '都市逍遥侠', '七天爱上你', '联合国护照', '我要吃鱼翅', '媳妇的眼泪', '妻子回来了', '临时性强奸', '蒂塔万提斯', '重庆护士门', '胡士托风波', '习惯了寂寞', '殡仪馆婚礼', '何必在一起', '世界问候日', '豚鼠特工队', '奥巴马女郎', '阶梯式电价', '周末无电脑', '历史的进程', '说不出的爱', '不能没有你', '嘻哈包袱铺', '巴不得爸爸', '毕打自己人', '娘家的故事', '传世群英传', '中国式民工', '霍莉桑普森', '洪荒蚊道人', '小矮人贝贝', '偷鸡小分队', '美丽高解像', '索马里石刑', '华谊小员工', '金花清感方', '天花板官员', '情系北大荒', '背对背拥抱', '僵尸奖门人', '活肤金蛋白', '布兰妮墨菲', '我们约会吧', '梳妆楼揭秘', '午夜出租车', '芒果训练营', '凡人修仙传', '呛口小辣椒', '迷失洛杉矶', '网络本拉登', '央务鹊桥网', '越南相亲记', '幸福一定强', '最后的较量', '四川的眼泪', '郭县令轶事', '超级学习机', '斯塔特米勒', '王老虎抢亲', '大小姐组合', '雪花与秘扇', '就想赖着你', '两毛钱一脚', '疯狂粉丝团', '美丽的尴尬', '玩具店之夜', '新版西游记', '阳仔演笑会', '遮蔽与记忆', '壹周立波秀', '优昙婆罗花', '超幸福鞋垫', '蜗牛也是牛', '富翁的诞生', '木下优树菜', '胡须吊带男', '犀利哥之歌', '北方有佳人', '商标的世界', '富春山居图', '抗旱概念股', '志明与春娇', '吊袜黑丝女', '阴间结婚证', '温州女秘书', '检察官公主', '师生接吻门', '女王的条件', '超人不会飞', '杨贵妃秘史', '河南地图网', '上海房产哥', '网上世博会', '勇敢的号角', '群体性癔病', '葛优酒店门', '北京台湾街', '神医大道公', '个人的趣向', '雨下一整晚', '父爱饥渴症', '网络情人节', '娱乐没有圈', '阿帕里西奥', '死亡手机号', '皮沃瓦洛娃', '为爱向前冲', '田中逗你玩', '田中斗笠王', '斯齐亚沃尼', '泡沫美人鱼', '妖精的尾巴', '我的心好冷', '厚街技校门', '春风不问路', '梦幻华尔兹', '伊万格琳娜', '火焰节之王', '盗贼的奖励', '就是要香恋', '决战刹马镇', '燕儿翩翩飞', '月球漫步者', '银蛇谋杀案', '学园默示录', '土耳其事件', '七个怎么看', '交大求婚门', '帝王修魔录', '金元大劫案', '心疼笔记本', '小姐大阅兵', '情越双白线', '芝麻官悟语', '林肯盒饭哥', '一路格桑花', '我要拍电影', '俺娘收废品', '恒星巨无霸', '吃蚊子主播', '超跑俱乐部', '中国达人秀', '父母皆祸害', '计算机世界', '白条毕业证', '父母年轻照', '泽尻英龙华', '新纳粹组织', '桑拿世锦赛', '明天的现实', '唐山大地震', '微小青春期', '婚姻保卫战', '快男包养门', '远古的传说', '世博接吻门', '互联网大会', '小向美奈子', '火焰龙卷风', '大唐女巡按', '中原城市群', '安逗与黑仔', '公司的力量', '成均馆绯闻', '注入流动性', '小企业贷款', '超预期下滑', '进一步放松', '大多数公司', '的到期时间', '的最低水平', '收益率上升', '收益率数据', '收益率下降', '最高级别的', '此刺激方案', '次平值增长', '对实体经济', '基金重仓股', '较长时间的', '金融风暴的', '民主党集团', '深化和蔓延', '向国会表示', '主要是由于', '总统大选后', '采取的举措', '全球范围内', '英国央行在', '但美国政府', '金融危机和', '美联储可能', '四千三百亿', '增加流动性', '机构投资者', '杠杆投资者', '投资者预期', '前一季度为', '耐用品支出', '服务业增长', '进一步加大', '制造业活动', '日央行理事', '提供流动性', '第二次降息', '欧元兑美元', '卡尔加里市', '埃德蒙顿市', '日本内阁府', '人民币贬值', '个税起征点', '可比市盈率', '进一步减息', '流动性危机', '短期流动性', '创新型工具', '流动性紧张', '保尔森表示', '救援助资金', '国集团峰会', '保尔森强调', '新一届政府', '度过过渡期', '月份零售额', '市场预期为', '当月零售额', '货币与金融', '主要工业国', '新兴经济体', '平等发言权', '华盛顿声明', '的最高标准', '场外衍生品', '监管共同体', '注重监管的', '总统当选人', '政策面利多', '昨日收盘价', '实际减持量', '大小非问题', '上升趋势线', '截至发稿时', '第二季度末', '为政府接管', '房地产市场', '各国决策层', '大型银行股', '部分银行股', '日收盘重挫', '美国汽车业', '临时性方案', '比利时财长', '美联储预测', '卡图研究所', '华盛顿峰会', '进一步降息', '美联储官员', '美国财政部', '美国政府与', '流动性获取', '大规模损失', '发行优先股', '美国纳税人', '致力于支持', '家庭和企业', '纳税人财富', '创历史新高', '预算前报告', '前一交易日', '风向标指数', '涨幅排行榜', '弗莱斯尼勒', '巴克莱银行', '资产负债表', '英国增值税', '建材零售商', '服装零售商', '道琼斯指数', '经济观察网', '上日收盘价', '克林顿政府', '管理委员会', '英镑兑美元', '英镑兑日元', '高收益货币', '澳元兑美元', '澳元兑日元', '一个月低点', '主要经济体', '第三季度的', '消费者开支', '美国消费者', '进出口数字', '食品和能源', '大规模失业', '劳动力市场', '电子盘交易', '日内走势图', '能源分析师', '经济硬着陆', '高风险资产', '欧佩克各国', '欧佩克主席', '较前月下降', '大幅度提高', '农民工返乡', '低收入群体', '农产品价格', '增值税转型', '企业所得税', '中国经济的', '发展规划部', '出口和投资', '名义增长率', '今年前三季', '实际增长率', '房地产投资', '较上年同期', '上游资源品', '工业品市场', '日盘中走跌', '制造业指数', '汽车注册量', '奇梦达公司', '金融投资者', '马德里市场', '中国证监会', '澳央行行长', '第四次降息', '美联储主席', '德克萨斯州', '进一步下调', '收益率下跌', '两年期国债', '个人消费者', '房地产债券', '经济扩张期', '显著型下降', '大萧条时期', '中国政府网', '农村信用社', '流动性问题', '土地经营权', '经营决策权', '进一步研究', '存款准备金', '支农再贷款', '工人生产力', '劳动力成本', '美国劳工部', '经修正后为', '初步报告的', '非常规手段', '公债收益率', '新西兰央行', '日本式通缩', '进一步走软', '褐皮书显示', '进一步放缓', '生产和开发', '工作小时数', '流动性方案', '中国经营网', '失业救济金', '中国证券网', '中国新闻网', '中国金融网', '进出口贸易', '政策性银行', '中国与美国', '去年同期的', '第三季逾期', '金融服务业', '贸易和投资', '中国和美国', '产品及服务', '高科技产品', '对华进口额', '银行间市场', '符合条件的', '失业率上升', '美国制造业', '修正后数据', '月份失业率', '的最高水平', '明年一季度', '进一步调低', '宽带互联网', '纽西兰央行', '创历史纪录', '行长特里谢', '欧元区经济', '环比负增长', '停滞或下滑', '累计下调了', '特里谢表示', '可持续增长', '非常规措施', '作出修正后', '劳动密集的', '瑞士再保险', '即将上任的', '发行或担保', '压低收益率', '摩根士丹利', '汽车制造商', '戴姆勒公司', '解聘通知书', '进一步恶化', '进一步提升', '失业率升至', '首席分析师', '经济增长率', '违约率上升', '促进流动性', '经常帐盈余', '新年报告会', '金融国九条', '中国经济网', '股票研究网', '股市投资者', '央企大股东', '进一步增持', '国家统计局', '宏观经济处', '适度宽松的', '新糖到货量', '创历史新低', '月零售销售', '中国证券报', '明年上半年', '中长期国债', '纽元兑美元', '美元兑加元', '中石化油站', '零售股上扬', '广东证监局', '融资租赁业', '外贸进出口', '再担保公司', '油菜籽期货', '燃料油价格', '平顶山分行', '燃油附加费', '收费类物业', '意大利央行', '以色列央行', '美元兑欧元', '董事会决议', '生活必需品', '第一食品网', '超常规下滑', '中国化工网', '食品饮料业', '增值税改革', '维生素企业', '五一路支行', '质押式回购', '买断式回购', '跨越式发展', '提示性公告', '聚氨酯企业', '产业推广会', '新年开门红', '偏股型基金', '有限售条件', '东方财富网', '荆门市分行', '创反弹新高', '中国银行股', '中国基金业', '高科技企业', '新加坡地区', '中国水泥网', '中高端客户', '利润增长点', '中国财经网', '差异化竞争', '中期防守线', '巴克莱资本', '迪斯尼项目', '新加坡银行', '美元兑日元', '成品油价格', '成品油定价', '美联储理事', '进出口数据', '中国通信网', '日元兑美元', '建议投资者', '持仓排名表', '明年二季度', '投资收益率', '合理化建议', '人民币贷款', '反垄断调查', '美元兑港元', '恒指认沽证', '奥地利财长', '欧元区各国', '初级投资者', '短期融资券', '非公开发行', '欧元兑英镑', '三季度利润', '中国银行业', '下属子公司', '控股子公司', '军工概念股', '装备制造业', '美元兑瑞郎', '日本财务省', '制度性改革', '创降幅纪录', '法律意见书', '上半年通缩', '国家发改委', '焦点房地产', '人民币汇率', '宝康消费品', '宝盈泛沿海', '长城双动力', '东方金账簿', '光大新增长', '海富通贰号', '海富通股票', '海富通回报', '海富通精选', '海富通收益', '海富通优势', '华安中国股', '华富竞争力', '汇添富成长', '汇添富均衡', '汇添富优势', '嘉实超短债', '金鹰中小盘', '开放式基金', '南方高增长', '融通新蓝筹', '上投阿尔法', '申万新动力', '申万新经济', '泰信中短债', '新世纪混合', '信诚四季红', '兴业可转债', '招募说明书', '中欧新趋势', '误导性陈述', '内外销比例', '广大投资者', '国内销售额', '消费者偏好', '水泵制造商', '中国信息报', '大型制造商', '一般纳税人', '增值税政策', '太平洋证券', '第一金融网', '进出口总额', '进一步裁员', '技术性反弹', '欧央行理事', '鹿特丹豆粕', '鹿特丹大豆', '上市委员会', '资源税改革', '新能源类股', '电子制造业', '封闭式基金', '欧元兑瑞郎', '外向型经济', '港珠澳大桥', '无条件退货', '临时董事会', '全球企业榜', '税后净利润', '新刺激方案', '官方销售价', '中国银行间', '英国财政部', '人民币结算', '地方政府债', '上海世博会', '阶段性底部', '无风险套利', '年第一季度', '一万五千点', '韩圆兑美元', '黑色星期三', '新元兑美元', '保险宣传月', '新救助计划', '信用卡业务', '个体工商户', '进一步反弹', '一季报业绩', '二季度策略', '新一轮上涨', '未平仓合约', '停复牌公告', '中国银监会', '一季度净利', '非利差收入', '亚洲电子盘', '住房公积金', '大连棕榈油', '德意志银行', '美元兑泰铢', '日圆交叉盘', '第一大股东', '一季度业绩', '全天成交额', '港股认股证', '证券分析师', '国际时装周', '贷记卡业务', '税负公平感', '新加坡橡胶', '菲律宾比索', '美元兑日圆', '美国农业部', '国际黄金网', '低成本策略', '伦敦金融城', '金融三戒律', '交银施罗德', '全流通时代', '核心竞争力', '交通意外险', '首席执行官', '工业增加值', '衍生品交易', '美国金融业', '陆家嘴论坛', '债券型基金', '香港金管局', '斯蒂格利茨', '金融衍生品', '全球供应商', '英格兰银行', '经济开发区', '政府救助金', '安全生产月', '执行副总裁', '布伦特期货', '消费者警告', '北京科博会', '渔业考察团', '低市盈板块', '抗风险能力', '保险代理人', '滨海概念股', '上海螺纹钢', '会员成交量', '经济参考报', '产品出厂价', '红色十字星', '第一季盈利', '非执行董事', '日异动点评', '记账式附息', '记账式贴现', '混合资本债', '成交量统计', '全日沽空额', '石油生产方', '俄罗斯经济', '检验检疫局', '提升竞争力', '社会保障局', '艺术品投资', '首席营销官', '新能源政策', '太阳能工厂', '蓝色预警区', '大盘驱动股', '最糟糕时期', '制造业产值', '前景不明朗', '第二次对话', '收藏型金条', '上行趋势线', '猪粮价格比', '德国经济部', '危机爆发前', '危机爆发后', '最宽裕阶段', '先导性信号', '太平洋保险', '去年四季度', '实施零关税', '财政部部长', '中小板指数', '沿海经济带', '新增开户数', '创年内新高', '北京代表处', '网上中签率', '电信设备股', '成立新公司', '罗维邓白氏', '新加坡股市', '索尼爱立信', '临港工业区', '最赚钱新股', '成交量萎缩', '企业决策者', '比亚迪电子', '流动性充裕', '谅解备忘录', '可操作方案', '土地出让金', '进口铁矿石', '特别提款权', '最困难时期', '煤炭招标会', '日本众议院', '人大财经委', '国家粮食局', '天津开发区', '金融价值榜', '日市场日报', '铁矿石谈判', '全世界最高', '股神巴菲特', '技术阻力位', '国家能源局', '关停小火电', '国家海洋局', '报复性反弹', '独立的产权', '白酒消费税', '超主权货币', '最低收购价', '放射事故率', '交通拥挤费', '两市总市值', '正回购协议', '泡沫化发行', '中国创业板', '房地产泡沫', '千亿以上的', '正回购操作', '正回购力度', '参考收益率', '较上周增加', '到期资金量', '市场流动性', '债券研究员', '可贷资金量', '京沪粤楼市', '自来水公司', '中纪委委员', '夹心层住房', '老工业基地', '年均增长率', '液化气价格', '大幅度增长', '升贴水报价', '房地产行业', '十个月高位', '美联储会议', '公交意外险', '战略性建仓', '新能源汽车', '国联安基金', '有色类个股', '上半年业绩', '日评级一览', '美联储决议', '半年净息差', '净利息收入', '未加工羊毛', '跌幅扩大至', '银行间债券', '劳埃德银行', '沪杭甬高速', '净流出资金', '中电投集团', '文化传播网', '战略灵活性', '太平洋寿险', '河北分公司', '中国保险网', '年期金融债', '今年下半年', '反价格垄断', '高送转公司', '汽车购置税', '新能源规划', '成品油市场', '已经上市的', '美国国安部', '只个股跌停', '银行倒闭案', '总承包合同', '股市大家谈', '财富非常道', '隐形重仓股', '因病退机票', '弃购经适房', '中国副外长', '轮胎特保案', '网络流行语', '铁矿石降价', '经适房政策', '交易量下降', '递交国务院', '铁矿石价格', '出口转内销', '发改委要求', '液化气供应', '国防部网站', '危机背景下', '美国参议员', '东南亚国家', '行政强制法', '土地增值税', '国内成品油', '国产大飞机', '收紧流动性', '呈几何增长', '新能源产业', '资本充足率', '太阳能产业', '成品油调价', '过山车行情', '新一轮通胀', '质量不合格', '受益股一览', '波浪式下跌', '汽车零部件', '设定大陆架', '客运燃油费', '信贷高增长', '股份制银行', '千万级煤矿', '东北振兴司', '商用车市场', '新闻发言人', '持仓帐户数', '开门红行情', '卡塔尔石油', '中美特保案', '放贷人条例', '上报国务院', '银行系基金', '个人所得税', '央企发言人', '提前见底股', '长话一费制', '最长黄金周', '人口老龄化', '扩张性政策', '新加坡石油', '卫生部部长', '发行价上限', '甲流概念股', '中国建材网', '全球第二大', '地产中国网', '上海迪士尼', '警惕和防范', '教育部官员', '互联网企业', '反倾销调查', '首次发审会', '开盘半小时', '新一轮行情', '航天发射场', '国家测绘局', '不确定因素', '中国消费者', '廉租房补贴', '高风险模式', '轮胎经销商', '日本新首相', '关闭小煤矿', '有条件通过', '创新型国家', '社科院专家', '股市波动性', '创业板公司', '内外部环境', '不合格批次', '经济新框架', '贷款证券化', '大小非洪峰', '经济半小时', '最重要职责', '克以内信件', '国务院通过', '超主权基金', '三档停牌制', '公务员代表', '鸡蛋过敏者', '人民币国债', '并购重组委', '公布中签率', '资金驱动型', '深圳证监局', '经济租赁房', '信用卡还款', '无限期服务', '公有制经济', '年新增贷款', '国际奥委会', '北京奥运会', '反垄断机构', '无专业精英', '房产交易量', '新一轮调整', '加拿大矿业', '征反倾销税', '人民币升值', '高校出版社', '进入倒计时', '可持续发展', '埃克森美孚', '中国轮胎业', '亿元俱乐部', '胡润百富榜', '最长保留期', '多晶硅项目', '确定发行价', '纪念性金条', '看病预付费', '铁矿石进口', '全国用电量', '三季度数据', '国家外汇局', '业务审核权', '西部大开发', '闲置公积金', '反腐新罪名', '汇率操纵国', '实现零关税', '保荐代表人', '央行副行长', '零售指导价', '市场化方向', '执行指导价', '铁矿石合约', '年第三季度', '实际控制人', '商业车保险', '净回笼资金', '资本输出国', '四季度业绩', '家上市公司', '大连软件园', '穆尔班原油', '澳元兑日圆', '隐性重仓股', '贷款换石油', '中国威胁论', '耐蚀合金板', '麦格理银行', '燃料油期货', '影响股一览', '甲流康复者', '房地产政策', '区域化货币', '多晶硅产业', '人民币账户', '高速公路网', '液晶面板业', '食品添加剂', '生产许可证', '最具影响力', '跨年度行情', '世贸专家组', '非理性繁荣', '发改委专家', '输入性通胀', '校长推荐制', '天然气项目', '商业贿赂罪', '新能源板块', '阶梯式电价', '外资零售店', '小排量政策', '公务员考试', '购房焦虑症', '出租车运营', '超标电动车', '提高印花税', '限价商品房', '成品油成本', '营业税优惠', '二手房市场', '一揽子计划', '新版火车票', '本地通话费', '证券业协会', '食用油价格', '香港迪士尼', '卫生部官员', '碳钢紧固件', '建筑设计员', '受益股全览', '烈士保险金', '领取养老金', '定量不定价', '政策可行性', '大规模投放', '上海国税局', '跨地区转移', '常规制造业', '新闻出版业', '天然气合同', '资源品价格', '标志性项目', '反倾销关税', '柴油批发价', '房产税制度', '爆发式增长', '铁矿石巨头', '政府采购者', '基金大分红', '海南房地产', '再融资审核', '房地产过热', '最低保证金', '央企负责人', '达沃斯年会', '保障性住房', '国务院参事', '折利率优惠', '后危机时代', '国家能源委', '移动互联网', '人均纯收入', '非主营业务', '深圳火车站', '廉价劳动力', '对外依存度', '财政性收入', '实名制车票', '阶段性成果', '第三方测费', '三季度来水', '中国外管局', '扬子晚报网', '高技术门槛', '中期净利润', '标准化生产', '人民币基金', '爱尔兰银行', '金融保险股', '荷兰保险商', '流动性操作', '季度折年率', '自由贸易区', '上海证券报', '伦敦证交所', '技术性回调', '一起外汇网', '系统性风险', '汽车保有量'], // 中文验证码字符串
        'fonts' => ['1.ttf', '2.ttf', '3.ttf', '4.ttf', '5.ttf', '6.ttf']
    ];
    private $_image = null;     // 验证码图片实例
    private $_color = null;     // 验证码字体颜色

    /**
     * 架构方法 设置参数
     * @access public
     * @param  array $config 配置参数
     */

    public function __construct($config = []) {
        $this->config = array_merge($this->config, $config);
    }

    /**
     * 使用 $this->name 获取配置
     * @access public
     * @param  string $name 配置名称
     * @return multitype    配置值
     */
    public function __get($name) {
        return $this->config[$name];
    }

    /**
     * 设置验证码配置
     * @access public
     * @param  string $name 配置名称
     * @param  string $value 配置值
     * @return void
     */
    public function __set($name, $value) {
        if (isset($this->config[$name])) {
            $this->config[$name] = $value;
        }
    }

    /**
     * 检查配置
     * @access public
     * @param  string $name 配置名称
     * @return bool
     */
    public function __isset($name) {
        return isset($this->config[$name]);
    }

    /**
     * 验证验证码是否正确
     * @access public
     * @param string $code 用户验证码
     * @param string $id 验证码标识
     * @return bool 用户验证码是否正确
     */
    public function check($code) {
        $key = $this->authcode(Encryption::getKey());
        // 验证码不能为空
        $secode = $_SESSION[$key] ?? '';
        if (empty($code) || empty($secode)) {
            return false;
        }
        // session 过期
        if (time() - $secode['verify_time'] > $this->expire) {
            unset($_SESSION[$key]);
            return false;
        }

        if ($this->authcode(strtoupper($code)) === $secode['verify_code']) {
            if ($this->reset) {
                unset($_SESSION[$key]);
            }
            return true;
        }

        return false;
    }

    /**
     * 输出验证码并把验证码的值保存的session中
     * 验证码保存到session的格式为： array('verify_code' => '验证码值', 'verify_time' => '验证码创建时间');
     * @access public
     * @param string $id 要生成验证码的标识
     * @return void
     */
    public function entry() {
        // 图片宽(px)
        $this->imagew || $this->imagew = $this->length * $this->fontsize * 1.5 + $this->length * $this->fontsize / 2;
        // 图片高(px)
        $this->imageh || $this->imageh = $this->fontsize * 2.5;
        // 建立一幅 $this->imagew x $this->imageh 的图像
        $this->_image = imagecreate($this->imagew, $this->imageh);
        // 设置背景
        imagecolorallocate($this->_image, $this->bg[0], $this->bg[1], $this->bg[2]);

        // 验证码字体随机颜色
        $this->_color = imagecolorallocate($this->_image, mt_rand(1, 150), mt_rand(1, 150), mt_rand(1, 150));
        // 验证码使用随机字体
        $ttfPath = __DIR__ . DS . 'Fonts' . DS . ($this->usecn ? 'Cn' : 'En') . DS;


        if (empty($this->fontttf)) {
            $dir = dir($ttfPath);
            $ttfs = [];
            while (false !== ($file = $dir->read())) {
                if ($file[0] != '.' && substr($file, -4) == '.ttf') {
                    $ttfs[] = $file;
                }
            }
            $dir->close();
            $this->fontttf = $ttfs[array_rand($ttfs)];
        }
        $this->fontttf = $ttfPath . $this->fontttf;


        if ($this->usenoise) {
            $this->_writeNoise();
        }
        if ($this->usecurve) {
            $this->_writeCurve();
        }
        // 绘验证码
        $code = []; // 验证码
        $codeNX = 0; // 验证码第N个字符的左边距

        if ($this->usecn) { // 中文验证码
            $cnset = $this->cnset[array_rand($this->cnset)];
            for ($i = 0; $i < 5; $i++) {
                $code[$i] = iconv_substr($cnset, $i, $i + 1, 'utf-8');
                imagettftext($this->_image, $this->fontsize, mt_rand(-10, 10), $this->fontsize * ($i + 1) * 1.5, $this->fontsize + mt_rand(10, 20), $this->_color, $this->fontttf, $code[$i]);
            }
        } else {
            for ($i = 0; $i < $this->length; $i++) {
                $code[$i] = $this->codeset[mt_rand(0, strlen($this->codeset) - 1)];
                $codeNX += mt_rand($this->fontsize * 1.2, $this->fontsize * 1.6);
                imagettftext($this->_image, $this->fontsize, mt_rand(-40, 40), $codeNX, $this->fontsize * 1.6, $this->_color, $this->fontttf, $code[$i]);
            }
        }


        // 保存验证码
        $key = $this->authcode(Encryption::getKey());
        $code = $this->authcode(strtoupper(implode('', $code)));
        $secode = [];
        $secode['verify_code'] = $code; // 把校验码保存到session
        $secode['verify_time'] = time();  // 验证码创建时间
        $_SESSION[$key] = $secode;
        header('Cache-Control: private, max-age=0, no-store, no-cache, must-revalidate');
        header('Cache-Control: post-check=0, pre-check=0', false);
        header('Pragma: no-cache');
        header("content-type: image/png");

        // 输出图像
        imagepng($this->_image);
        imagedestroy($this->_image);
    }

    /**
     * 画一条由两条连在一起构成的随机正弦函数曲线作干扰线(你可以改成更帅的曲线函数)
     *
     *      高中的数学公式咋都忘了涅，写出来
     * 		正弦型函数解析式：y=Asin(ωx+φ)+b
     *      各常数值对函数图像的影响：
     *        A：决定峰值（即纵向拉伸压缩的倍数）
     *        b：表示波形在Y轴的位置关系或纵向移动距离（上加下减）
     *        φ：决定波形与X轴位置关系或横向移动距离（左加右减）
     *        ω：决定周期（最小正周期T=2π/∣ω∣）
     *
     */
    private function _writeCurve() {
        $px = $py = 0;

        // 曲线前部分
        $A = mt_rand(1, $this->imageh / 2);                  // 振幅
        $b = mt_rand(-$this->imageh / 4, $this->imageh / 4);   // Y轴方向偏移量
        $f = mt_rand(-$this->imageh / 4, $this->imageh / 4);   // X轴方向偏移量
        $T = mt_rand($this->imageh, $this->imagew * 2);  // 周期
        $w = (2 * M_PI) / $T;

        $px1 = 0;  // 曲线横坐标起始位置
        $px2 = mt_rand($this->imagew / 2, $this->imagew * 0.8);  // 曲线横坐标结束位置

        for ($px = $px1; $px <= $px2; $px = $px + 1) {
            if ($w != 0) {
                $py = $A * sin($w * $px + $f) + $b + $this->imageh / 2;  // y = Asin(ωx+φ) + b
                $i = (int) ($this->fontsize / 5);
                while ($i > 0) {
                    imagesetpixel($this->_image, $px + $i, $py + $i, $this->_color);  // 这里(while)循环画像素点比imagettftext和imagestring用字体大小一次画出（不用这while循环）性能要好很多
                    $i--;
                }
            }
        }

        // 曲线后部分
        $A = mt_rand(1, $this->imageh / 2);                  // 振幅
        $f = mt_rand(-$this->imageh / 4, $this->imageh / 4);   // X轴方向偏移量
        $T = mt_rand($this->imageh, $this->imagew * 2);  // 周期
        $w = (2 * M_PI) / $T;
        $b = $py - $A * sin($w * $px + $f) - $this->imageh / 2;
        $px1 = $px2;
        $px2 = $this->imagew;

        for ($px = $px1; $px <= $px2; $px = $px + 1) {
            if ($w != 0) {
                $py = $A * sin($w * $px + $f) + $b + $this->imageh / 2;  // y = Asin(ωx+φ) + b
                $i = (int) ($this->fontsize / 5);
                while ($i > 0) {
                    imagesetpixel($this->_image, $px + $i, $py + $i, $this->_color);
                    $i--;
                }
            }
        }
    }

    /**
     * 画杂点
     * 往图片上写不同颜色的字母或数字
     */
    private function _writeNoise() {
        $codeset = '01235678abcdefhijkmnpqrstuvwxyz';
        for ($i = 0; $i < 10; $i++) {
            //杂点颜色
            $noiseColor = imagecolorallocate($this->_image, mt_rand(150, 225), mt_rand(150, 225), mt_rand(150, 225));
            for ($j = 0; $j < 5; $j++) {
                // 绘杂点
                imagestring($this->_image, 5, mt_rand(-10, $this->imagew), mt_rand(-10, $this->imageh), $codeset[mt_rand(0, 29)], $noiseColor);
            }
        }
    }

    /* 加密验证码 */

    private function authcode($str) {
        $key = substr(md5(Encryption::getKey()), 5, 8);
        $str = substr(md5($str), 8, 10);
        return md5($key . $str);
    }

}
